companies/app/views/companies/show.html.erb


    <% if @company.founders.length < 1 %>
---
SELECT "founders".* FROM "founders" WHERE "founders"."company_id" = ?  [["company_id", 11]]

    <h3>Tags</h3>
    <% if @company.tags.length > 0 %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."company_id" = ?  [["company_id", 1]]