companies/app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "location", "description", "date_founded", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @company = Company.new(company_params)

    if @company.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "companies" SET "description" = ?, "date_founded" = ?, "updated_at" = ? WHERE "companies"."id" = ?
---
  def update
    @company = Company.find(params[:id])

    if @company.update(company_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 1]]
---
  def destroy
    @company = Company.find(params[:id])
    @company.destroy