companies/app/controllers/founders_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "founders" ("full_name", "title", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_name", "Cliff Shaw"], ["title", "CEO"], ["company_id", 1], ["created_at", "2017-10-17 06:35:31.407950"], ["updated_at", "2017-10-17 06:35:31.407950"]]
---
  def create
    @company = Company.find(params[:company_id])
    @founder = @company.founders.create(founder_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "founders".* FROM "founders" WHERE "founders"."company_id" = ? AND "founders"."id" = ? LIMIT ?  [["company_id", 11], ["id", 2], ["LIMIT", 1]]
DELETE FROM "founders" WHERE "founders"."id" = ?  [["id", 2]]
---
  def destroy
    @company = Company.find(params[:company_id])
    @founder = @company.founders.find(params[:id])
    @founder.destroy