companies/app/controllers/tags_controller.rb

  def create
    @company = Company.find(params[:company_id])

    @tag = @company.tags.create(tag_params)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tags" ("text", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "acquired"], ["company_id", 1], ["created_at", "2017-10-17 06:35:37.467543"], ["updated_at", "2017-10-17 06:35:37.467543"]]